; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	spectrograph0 - mode
	spectrograph1 - mode
	GroundStation1 - direction
	GroundStation5 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star4 - direction
	Star6 - direction
	GroundStation0 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Star12 - direction
	Star13 - direction
	Star14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 spectrograph1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument3 spectrograph0)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star6)
	(supports instrument4 spectrograph0)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
)
(:goal (and
	(pointing satellite0 Planet9)
	(have_image Phenomenon7 spectrograph0)
	(have_image Phenomenon8 spectrograph1)
	(have_image Planet9 spectrograph0)
	(have_image Phenomenon10 spectrograph1)
	(have_image Star11 spectrograph1)
	(have_image Star12 spectrograph0)
	(have_image Star13 spectrograph0)
	(have_image Star14 spectrograph1)
	(have_image Star15 spectrograph1)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 10
2. (calibrate satellite1 instrument3 star6)
   added: (calibrated instrument3)
   goals met: 0 of 10
3. (turn_to satellite1 planet9 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 planet9)
   goals met: 0 of 10
4. (take_image satellite1 planet9 instrument3 spectrograph0)
   added: (have_image planet9 spectrograph0)
   goals met: 1 of 10
5. (turn_to satellite1 phenomenon8 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 phenomenon8)
   goals met: 1 of 10
6. (take_image satellite1 phenomenon8 instrument3 spectrograph1)
   added: (have_image phenomenon8 spectrograph1)
   goals met: 2 of 10
7. (turn_to satellite1 phenomenon7 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon7)
   goals met: 2 of 10
8. (take_image satellite1 phenomenon7 instrument3 spectrograph0)
   added: (have_image phenomenon7 spectrograph0)
   goals met: 3 of 10
9. (turn_to satellite1 phenomenon10 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon10)
   goals met: 3 of 10
10. (take_image satellite1 phenomenon10 instrument3 spectrograph1)
   added: (have_image phenomenon10 spectrograph1)
   goals met: 4 of 10
11. (turn_to satellite0 planet9 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 planet9)
   goals met: 5 of 10
12. (turn_to satellite1 star11 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star11)
   goals met: 5 of 10
13. (take_image satellite1 star11 instrument3 spectrograph1)
   added: (have_image star11 spectrograph1)
   goals met: 6 of 10
14. (turn_to satellite1 star12 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star12)
   goals met: 6 of 10
15. (take_image satellite1 star12 instrument3 spectrograph0)
   added: (have_image star12 spectrograph0)
   goals met: 7 of 10
16. (turn_to satellite1 star13 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star13)
   goals met: 7 of 10
17. (take_image satellite1 star13 instrument3 spectrograph0)
   added: (have_image star13 spectrograph0)
   goals met: 8 of 10
18. (turn_to satellite1 star14 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star14)
   goals met: 8 of 10
19. (take_image satellite1 star14 instrument3 spectrograph1)
   added: (have_image star14 spectrograph1)
   goals met: 9 of 10
20. (turn_to satellite1 star15 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star15)
   goals met: 9 of 10
21. (take_image satellite1 star15 instrument3 spectrograph1)
   added: (have_image star15 spectrograph1)
   goals met: 10 of 10
